# Данная команда говорит нам о том какой
# образ будет взят за основной, в нашем случае python 3
# будет скачан с dockerhub
FROM python:3.9

# Устанавливаем рабочую директорию для проекта в контейнере
# Директория по умолчанию
WORKDIR /app

# Копируем папку с хостовой системы в контейнер
COPY ./app /app

# Команда RUN просто выполнит bash скрипт
# и установит python пакеты
RUN pip3 install --upgrade pip -r requirements.txt

# Резервируем порт, который будет использоваться для сервера
EXPOSE 5000

# Выполняем скрипт после сборки образа
# Должна быть обязательно определена

CMD ["python3", "app.py"]